import type { QuestionsType } from '@/types/questions.type';

export const QUESTIONS: QuestionsType[] = [
  {
    heading: 'Скільки коштує розробка чат-бота?',
    description: `<p>Вартість залежить від складності проєкту, функціоналу та інтеграцій:</p>
              <div>
                <p><b>Чат-бот на конструкторі</b> – від <b>$300</b></p>
                <p><b>Кастомна розробка</b> – від <b>$800</b></p>
              </div>
              <p>
                Ми аналізуємо ваші задачі, бізнес-процеси, робимо прорахунок з різними
                варіантами рішень і тільки після цього пропонуємо точну вартість.
              </p>`,
  },
  {
    heading: 'Скільки часу розробляється чат-бот?',
    description: `<p>Залежить від складності:</p>
              <div>
                <p>Простий бот на конструкторі – від <b>7 днів</b></p>
                <p>Бот із кастомною логікою – <b>від 2 до 6 тижнів</b></p>
                <p>Високонавантажені боти з інтеграціями – <b>від 2 місяців</b></p>
              </div>`,
  },
  {
    heading: 'З якими системами і сервісами ви можете інтегрувати чат-бот?',
    description: `<p>Чат-боти можуть інтегруватися з:</p>
              <div>
              <p><b>CRM та ERP-системами</b> (Pipedrive, Bitrix24, AmoCRM, HubSpot, 1C, SAP, Odoo та ін.)</p>
              <p><b>Платіжними системами</b> (LiqPay, Fondy, Stripe, PayPal, Monobank, PrivatBank API)</p>
              <p><b>Обліковими та управлінськими сервісами</b> (Google Sheets, Notion, Airtable, Trello, Jira)</p>
              <p><b>IP-телефонією та кол-центрами</b> (Binotel, Ringostat, Twilio, Asterisk)</p>
              <p><b>Чатами підтримки</b> (Zendesk, Intercom, LiveChat, Tawk.to)</p>
              <p><b>AI та NLP-системами</b> (OpenAI GPT, Google Dialogflow, IBM Watson)</p>
              <p><b>Логістичними сервісами</b> (Нова Пошта, Укрпошта, Glovo, Bolt Food)</p>
              </div>`,
  },
  {
    heading: 'Як правильно обрати месенджер для чат-бота?',
    description: `<p>Головний критерій – <b>де знаходиться ваша аудиторія.</b> В Україні популярність месенджерів розподіляється так:</p>
              <div>
                <p><b>1️⃣ Telegram</b> – найпопулярніший, підходить для автоматизації бізнес-процесів, маркетингу та продажів.</p>
                <p><b>2️⃣ Viber</b> – актуальний для B2C, масових розсилок та роботи з картами лояльності.</p>
                <p><b>3️⃣ Instagram Direct</b> – ефективний для e-commerce та взаємодії з аудиторією бренду.</p>
                <p><b>4️⃣ Facebook Messenger</b> – зручний для реклами та клієнтської підтримки.</p>
                <p><b>5️⃣ WhatsApp</b> – добре працює для персоналізованого сервісу та B2B-комунікацій.</p>
                <p><b>6️⃣ Чат-бот на сайті</b> – універсальний варіант, незалежний від месенджерів, працює для будь-якої аудиторії.</p>
              </div>
              <p>
               Якщо не знаєте, який месенджер обрати – ми допоможемо підібрати оптимальний варіант для вашого бізнесу.
              </p>`,
  },
  {
    heading: 'Чи потрібна підтримка чат-бота? Чи можемо ми далі працювати без вас?',
    description: `<p>Не всі проєкти потребують постійної підтримки. <b>Ми надаємо гарантію на розроблений чат-бот,</b> і якщо це стандартне рішення – воно працюватиме без додаткових втручань.</p>
              <p>
                Але якщо бот має складну бізнес-логіку, інтеграції з CRM, платіжними системами чи API сторонніх сервісів – <b>краще передбачити технічну підтримку</b> для оновлення, оптимізації та розширення функціоналу.
              </p>
              <p>У будь-якому випадку, ми передаємо всі доступи та документацію, щоб ви могли керувати ботом самостійно або передати його підтримку своїй команді.</p>
              `,
  },
  {
    heading: 'Ви працюєте офіційно?',
    description: `<p>Так, ми працюємо офіційно (ФОП 3 групи), надаємо <b>договір, рахунки, акти виконаних робіт.</b></p>
              `,
  },
  {
    heading: 'Чи може чат-бот замінити сайт або мобільний додаток?',
    description: `<p>У багатьох випадках – так. Чат-бот може виконувати <b>більшість функцій мобільного додатку</b>: приймати оплату, бронювати послуги, керувати підписками, відправляти персоналізовані сповіщення. При цьому <b>він дешевший у розробці та не вимагає встановлення.</b></p>
              `,
  },
  {
    heading: 'Як швидко окуповується чат-бот?',
    description: `<p>Залежить від бізнесу та його використання.</p>
    <div>
                <p><b>Маркетингові боти</b> починають приносити заявки з першого дня.</p>
                <p><b>Автоматизація процесів</b> економить 30-80% часу співробітників.</p>
                  <p><b>Середній термін окупності</b> чат-бота – <b>від 1 тижня до 6 місяців.</b></p>
              </div>
              `,
  },
];
